Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །རྣམ་པར་འབར་བའི་ལུས་དང་རབ་ལྡན་ཞིང་།
en: Their bodies will shine brightly,

source: །མཚན་བཟང་སུམ་ཅུ་རྩ་གཉིས་དེ་ལ་འབྱུང་།
en: Adorned by the thirty-two excellent signs. {40} “They will attain the conduct that is within the supreme samādhi

source: །ཕན་ཡོན་གཞན་ཡང་མང་པོ་མཐའ་ཡས་པ། །ཏིང་འཛིན་མཆོག་ལ་སྤྱོད་པས་ཐོབ་པར་འགྱུར།
en: And an endless multitude of other benefits.

source: །རྟག་ཏུ་མི་སྒུལ་སྟོབས་ཀྱང་ཆེ་བར་འགྱུར།
en: They will always have great, unshakable strength

source: །དེ་ཡི་གཟི་བརྗིད་རྒྱལ་པོས་མི་བཟོད་དེ།
en: And a majesty that outshines that of kings. {41}

source: །མཁས་པ་སུ་དག་སངས་རྒྱས་ཆོས་སྤྱོད་པ།
en: “The wise who practice the Buddha’s Dharma

source: །བྱད་བཞིན་བཟང་ཞིང་ཤིན་ཏུ་མཛེས་པར་འགྱུར།
en: Will have an excellent appearance and great beauty.

source: །བསོད་ནམས་གཟི་བརྗིད་དཔལ་གྱིས་མངོན་འཕགས་ཏེ།
en: Their merit and majesty and splendor will increase.

source: །ལྷས་ཀྱང་དེ་ཡི་གཟི་བརྗིད་བཟོད་མི་འགྱུར།
en: Their majesty will outshine even that of the devas. {42}

source: །སུ་དག་བྱང་ཆུབ་སེམས་ལ་བརྟན་གནས་པ།
en: “Those who steadfastly remain in the aspiration to enlightenment

source: །དེ་ནི་རྟག་ཏུ་སྲོག་ཆགས་ཀུན་གྱི་བཤེས། །སངས་རྒྱས་བྱང་ཆུབ་འདི་ནི་རབ་སྟོན་པ།
en: Will always be friends to all beings.

source: །དེ་ལ་ནམ་ཡང་མུན་པ་མེད་པར་འགྱུར།
en: There will never be any darkness

source: །སྒྲ་དང་ཚིག་གི་ལམ་བྲལ་བརྗོད་དུ་མེད།
en: In their teaching of the enlightenment of buddhahood. {43}

source: །ནམ་མཁའ་ཇི་བཞིན་ཆོས་ཀྱི་རང་བཞིན་ཏེ།
en: “The nature of phenomena is like that of space, Inexpressible, beyond speech and words.

source: །འདི་ལྟ་བུ་ཡི་ཚུལ་མཆོག་རྣམ་རིག་ན།
en: Those who know that supreme nature

source: །དེ་ཡི་སྤོབས་པ་དག་ཀྱང་མི་ཟད་འགྱུར།
en: Will have an unceasing confidence in teaching. {44}

source: །མདོ་སྡེ་དག་ནི་བརྒྱ་སྟོང་རབ་བཤད་ཀྱང་།
en: “Even though they teach a hundred thousand sūtras,

source: །སྔོན་གྱི་མཐའ་མ་ཕྲ་ཞིབ་རབ་ཏུ་ཤེས།
en: They know the finest details of the past. The wise will always have unimpeded speech,

source: །ཆོས་ཀྱི་རང་བཞིན་ཤིན་ཏུ་ཕྲ་ཤེས་པས། །མཁས་པའི་ཚིག་ནི་རྟག་ཏུ་ཐོགས་པ་མེད།
en: Knowing the subtlety of the nature of phenomena. {45}

source: །རྟག་པར་ཚུལ་བརྒྱ་དག་ལ་མཁས་གྱུར་ཅིང་།
en: “They will be skilled in hundreds of ways.

source: །སྒྲ་དང་ངེས་ཚིག་རྣམ་པ་མང་ལ་མཁས།
en: They will have mastered the many kinds of words and definitions.

source: །ལས་དང་འབྲས་བུ་རྣམ་སྨིན་ངེས་པ་སྟེ།
en: They have certainty in the ripening of actions and results.

source: །ཁྱད་པར་འཕགས་པའི་བྱེ་བྲག་དེ་འདྲར་འགྱུར།
en: They become distinctively preeminent in that way. {46} “They will possess unimpaired power.

source: །མཁས་པ་བདག་ཉིད་ཆེན་པོ་སྟོབས་བཅུའི་སྲས། །མ་ཚང་མེད་པའི་སྟོབས་ཀྱིས་ཤུགས་འཆང་ཞིང་།
en: They are great wise ones, the heirs of those with the ten strengths.

source: །ཤིན་ཏུ་ཕྲ་བའི་རང་བཞིན་ཆོས་ཤེས་པས།
en: Knowing the subtle nature of phenomena,

source: དེ་ཡི་དྲན་པ་རྟག་པར་ཡོངས་སུ་དག །ཤིན་ཏུ་ཕྲ་བའི་རང་བཞིན་ཆོས་ཤེས་པས།
en: They will always have a completely pure memory. {47} “Because they know the subtle nature of phenomena,

source: །ཡིད་དུ་མི་འོང་སྒྲ་ནི་ཐོས་མི་འགྱུར།
en: They will never hear an unpleasant sound.

source: །རྟག་ཏུ་སྙན་ཅིང་ཡིད་འོང་སྒྲ་ཡང་ཐོས།
en: They always hear pleasant and melodious sounds

source: །དེ་ཡི་ཚིག་ནི་རྟག་ཏུ་ཡིད་འོང་འགྱུར།
en: And their words are always pleasant. {48}

source: །དྲན་དང་བློ་གྲོས་ཤེས་རབ་རྟོགས་དང་ལྡན།
en: They have memory, understanding, wisdom, and realization.

source: །དེ་བཞིན་སེམས་ཀྱང་རྙོག་མེད་དང་བར་འགྱུར།
en: Similarly, their minds are clear and unpolluted

source: །མདོ་སྡེ་བརྒྱ་ཕྲག་དུ་མ་རབ་ཏུ་འཆད། །ཡོན་ཏན་འདི་འདྲའི་རང་བཞིན་ཆོས་ཤེས་པས།
en: And they teach many hundreds of sūtras. {49}

source: །ཡི་གེ་དང་ནི་ཚིག་རྣམས་འབྱེད་ལ་མཁས།
en: “They are learned in the categories of letters and words.

source: །ཐ་དད་པ་ཡི་སྒྲ་མང་དུ་མ་ཤེས།
en: They know many different kinds of sounds,

source: །དོན་དང་ཚིག་འབྲུ་ལ་ཡང་མཁས་པར་འགྱུར།
en: And they are skilled in meanings and letters. They have these qualities through knowing the nature of phenomena. {50}

source: །ལྷ་དང་མི་དང་ཀླུ་འབྲུག་སྲིན་པོ་དང་། །ལྷ་མིན་ལྟོ་འཕྱེ་མིའམ་ཅི་ལ་ཡང་། །རྟག་ཏུ་སྡུག་ཅིང་ཡིད་དུ་འོང་བར་འགྱུར།
en: They are always attractive and charming To devas, humans, nāgas, and rākṣasas, Asuras, mahoragas, and kinnaras. {51}

source: །འབྱུང་པོ་ཡི་དགས་སྲིན་པོའི་ཚོགས་རྣམས་ནི། །ཤ་ལ་ཟ་བ་ཤིན་ཏུ་མི་བཟད་པ། །དེ་དག་ནམ་ཡང་དེ་ལ་འཇིགས་མི་བྱེད།
en: The extremely terrible and flesh-devouring Crowds of spirits, pretas, and rākṣasas. {52}

source: །མཁས་པ་དེ་དག་ཡངས་པའི་གཏམ་ཐོས་ནས།
en: “Those who hear the vast teaching of the wise

source: །ཤིན་ཏུ་དགའ་ཞིང་བ་སྤུ་ཟིང་ཞེས་བྱེད།
en: Experience vast joy and their hairs stand on end.

source: །སངས་རྒྱས་ལ་ཡང་དགའ་བ་རྒྱ་ཆེར་སྐྱེད།
en: They develop a vast attraction to the buddhas,

source: །དེ་དག་བསམ་གྱིས་མི་ཁྱབ་དོན་ཆེན་འཐོབ།
en: And gain a vast, inconceivable benefit. {53}

source: །བདེ་བར་གཤེགས་པའི་ཆོས་མཛོད་འདི་བཟུང་བའི། །བསྐལ་པ་སྟོང་མང་དེ་ཡི་བསོད་ནམས་སྟོབས། །རབ་ཏུ་བརྗོད་ཀྱང་རྫོགས་པར་མི་ནུས་ཏེ། །དཔག་ཏུ་མེད་ཅིང་མཐའ་ཡས་ཚད་མེད་དོ།
en: “Even by speaking for many thousands of eons It is not possible to describe the power of the merit That comes from memorizing this Dharma treasure of the sugatas. It is immeasurable, infinite, and unquantifiable. {54} “The jinas to whom offerings have been made in the past, The countless buddhas of the future,

source: །ཏིང་འཛིན་ཞི་བའི་མཆོག་འདི་བཟུང་བ་ཡིས། །འདས་པའི་རྒྱལ་བ་དཔག་མེད་ཐམས་ཅད་དང་། །སངས་རྒྱས་མ་བྱོན་པ་དང་ཕྱོགས་བཅུ་ན། །སངས་རྒྱས་གང་བཞུགས་དེ་དག་དེ་ཡིས་མཆོད།
en: And the buddhas who are present in the ten directions, Are so by having memorized this supreme samādhi of peace. {55}

source: །སྐྱེས་བུ་ལ་ལ་བསོད་ནམས་འདོད་པས་འདིར།
en: “If a person who wishes for merit, With immeasurable affection for them

source: །སྟོབས་བཅུ་ལྡན་པའི་ཐུགས་རྗེ་ཅན་དག་ལ། །དགའ་བ་དཔག་ཏུ་མེད་པ་བསྐྱེད་ནས་ནི།
en: Serves compassionate ones with the ten strengths

source: །བསྐལ་པ་མཐའ་ཡས་དཔག་མེད་རིམ་གྲོ་བྱས།
en: For countless endless millions of eons, {56}

source: །སྐྱེས་བུ་གཉིས་པ་བསོད་ནམས་འདོད་པ་ཡིས།
en: “And if a second person who wishes for merit

source: །དོན་དམ་ཚུལ་འདི་ལས་ནི་ཚིགས་བཅད་གཅིག །ཕྱི་མའི་དུས་སུ་གྱུར་ཚེ་འཛིན་པ་ནི།
en: Memorizes, during future times, One verse from this way of the ultimate truth,

source: །དེ་ལ་སྔ་མའི་བསོད་ནམས་ཆར་མི་ཕོད།
en: Then the previous person’s merit will not even be a fraction of that. {57}

source: །འདི་ནི་སངས་རྒྱས་མཆོད་པ་རབ་མཆོག་སྟེ།
en: “This will be the supreme offering to the buddhas.

source: །ཕྱི་མ་མི་བཟད་དུས་སུ་གྱུར་པའི་ཚེ།
en: During the future dreadful times

source: །འདི་ལས་ཚིག་བཞིའི་ཚིགས་བཅད་གཅིག་ཐོས་ནས།
en: Hearing one of these four-line verses

source: །འཛིན་པ་དེས་ནི་སངས་རྒྱས་ཐམས་ཅད་མཆོད།
en: And memorizing it will be an offering to all the buddhas. {58}

source: །དེ་དག་རྟག་ཏུ་རྙེད་མཆོག་ལེགས་པར་རྙེད།
en: “They will always obtain the best provisions.

source: །དེ་དག་གྲོང་གི་ཟས་མཆོག་ལེགས་པར་ཟོས།
en: They will always eat the best alms of the land.

source: །སྟོབས་བཅུའི་སྲས་ཀྱི་ཐུ་བོ་དམ་པ་སྟེ།
en: As the best senior heirs of the one with ten strengths,

source: དེ་ཡིས་རྒྱལ་བ་མང་པོ་ཡུན་རིང་མཆོད།
en: They will for a long time make offerings to many jinas. {59}

source: །བྱ་རྒོད་ཕུང་པོའི་རི་འདིར་ང་ཡང་མཐོང་།
en: “They will also see myself here on Vulture Peak Mountain.

source: །དེ་དག་སངས་རྒྱས་མཁྱེན་ལ་ངས་ལུང་བསྟན།
en: And I, in buddha wisdom, will thus prophesy to them.

source: །མྱ་ངན་ང་འདས་ནས་ནི་བྱམས་པ་ཡང་།
en: Also, after my passing away, there will be Maitreya,

source: །དེ་ཚེ་དེ་ལ་ལུང་ཡང་སྟོན་པར་འགྱུར།
en: Who at that time will also prophesy to them. {60}

source: །དེ་བཞིན་སངས་རྒྱས་ཚེ་དཔག་མེད་པ་ཡང་། །ང་ཡི་བདེ་བ་ཅན་དུ་ཀུན་འདོད་ཞེས།
en: “Similarly, Buddha Amitāyus also

source: །ཕན་ཡོན་རྣམ་པ་དུ་མ་དེ་ལ་འཆད།
en: Has taught many other kinds of benefits: ‘All will enter my Sukhāvatī,

source: །མངོན་དགའ་དེར་སོང་སངས་རྒྱས་མི་འཁྲུགས་མཐོང་།
en: And go to Abhirati and see Buddha Akṣobhya.’ {61}

source: །བསྐལ་པ་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པར་ཡང་།
en: “For countless hundreds of thousands of eons

source: །ལོགས་པར་ལྟུང་བའི་འཇིགས་པ་ཡོང་མི་འབྱུང་།
en: They will never have the fear of downfalls.

source: །བྱང་ཆུབ་སྤྱད་པ་མཆོག་འདི་སྤྱོད་པ་ནི།
en: In this supreme practice of bodhisattva conduct

source: །རྟག་ཏུ་ཡིད་རབ་བདེ་བ་མྱོང་བར་འགྱུར།
en: They will always experience happiness. {62}

source: །དེ་ཕྱིར་བྱེ་བྲག་འདི་འཕགས་དེ་འདྲ་སྟེ།
en: “In that way it has been taught that this,

source: །འདི་ནི་རབ་ཏུ་བཤད་པ་ཕན་ཡོན་མཆོག །སོ་སོའི་ཚིག་ལ་ང་ཡི་རྗེས་སློབས་ལ།
en: Which is preeminent, has the most excellent merit. May I learn every single word,

source: །ཕྱི་མའི་དུས་ལ་མདོ་སྡེ་འདི་ཟུང་ཤིག །མདོ་སྡེ་འཛིན་པའི་ལེའུ་སྟེ་བཅུ་གཅིག་པའོ།། །།
en: And in future times be a keeper of this sūtra.” {63} Conclusion of the eleventh chapter, “Becoming a Keeper of the Sūtra.” The Training According to the Samādhi Chapter 12

source: གཞོན་ནུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཤེས་པ་དེའི་ཡོན་ཏན་དང་ཕན་ཡོན་དེ་ལྟ་བུར་འགྱུར་རོ།
en: “Young man, those are the qualities and benefits that bodhisattvas who know the nature of all phenomena will have.

source: །དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་དང་བསྔགས་པ་ཡང་དག་པར་སྨྲའོ།
en: They will describe the true, excellent qualities of the tathāgatas.

source: །དེ་བཞིན་གཤེགས་པ་ལ་ཡང་དག་པ་མ་ཡིན་པ་དང་མེད་པས་མི་སྐུར་ཏོ།
en: They will not falsely say that which is untrue about the tathāgatas.

source: ཆོས་གང་གིས་དེ་བཞིན་གཤེགས་པར་རབ་ཏུ་དབྱེ་བའི་ཆོས་ཉིད་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཤིང་། །སངས་རྒྱས་ཀྱི་ཡོན་ཏན་མཐའ་ཡས་པར་རབ་ཏུ་ཤེས་སོ།
en: It is because they know perfectly that nature, which is the nature through which a tathāgata comes to be. They know the infinite qualities of a buddha.

source: གཞོན་ནུ་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ནི་མཐའ་ཡས་ཏེ། བསམ་གྱིས་མི་ཁྱབ་ཅིང་བསམ་པ་དང་བྲལ་བས་ན།
en: Young man, the qualities of a buddha are infinite, inconceivable, beyond thought.

source: །དེ་དག་བསམ་པའམ་དཔག་པར་མི་ནུས་སོ།
en: They cannot be conceived or measured.

source: གཞོན་ནུ་སེམས་ཀྱི་ངོ་བོ་ཉིད་ནི་གཟུགས་མེད་པ་བསྟན་དུ་མེད་པ་སྟེ། གཞོན་ནུ་དེ་ལྟར་སེམས་ཀྱི་ངོ་བོ་ཉིད་གང་ཡིན་པ་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་ངོ་བོ་ཉིད་ཀྱང་དེ་ཡིན་ནོ།
en: The mind, young man, is taught to be without a nature of its own, to be without form. Young man, that nature of the mind is also the nature of the qualities of a buddha.

source: །སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་བཞིན་གཤེགས་པའི་ངོ་བོ་ཉིད་ཀྱང་དེ་ཡིན་ནོ། །དེ་བཞིན་གཤེགས་པའི་ངོ་བོ་ཉིད་གང་ཡིན་པ་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཀྱང་དེ་ཡིན་ཏེ།
en: That nature of the qualities of a buddha is also the nature of the tathāgatas, and that is the nature of all phenomena.

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དེ་ལྟར་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་དོན་གཅིག་ཏུ་བསྟན་པ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དེ་ནི་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡིད་ཀྱིས་ངེས་པར་བརྟགས་པ་ཞེས་བྱ་སྟེ།
en: “Young man, the bodhisattva mahāsattvas who know correctly that teaching on the nature of all the qualities are, young man, called bodhisattva mahāsattvas with profound comprehension.

source: འབྱུང་བ་ལ་མཁས་ཤིང་ཁམས་གསུམ་ལས་འབྱུང་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They are skilled in emancipation. They know perfectly emancipation from the three realms.

source: །ཇི་ལྟ་བ་བཞིན་དུ་ལྟ་ཞིང་ལོག་པར་མི་སྨྲ། རྣམ་པ་གཞན་དུ་མི་སྨྲ།
en: They have perfect knowledge, do not teach that which is erroneous, and do not say that which is anything other than true.

source: ཇི་སྐད་སྨྲ་བ་དེ་བཞིན་བྱེད།
en: Their conduct is in line with what they teach.

source: ཁམས་གསུམ་ལ་མ་ཆགས་ཤིང་ཁམས་གསུམ་ལས་ཡང་དག་པར་འདས་ཏེ།
en: They have no attachment to the three realms. They have transcended the three realms.

source: འདོད་པའི་ས་དང་གཟུགས་ཀྱི་ས་དང་གཟུགས་མེད་པའི་ས་དང་ཉོན་མོངས་པའི་ས་དང་མིང་གི་ས་དང་སྒྲའི་ས་ལས་འདས་ཤིང་ཡི་གེ་དང་ཆོས་ཀྱི་ཚུལ་ལ་མཁས་པ། ཡེ་ཤེས་མི་ཟད་པར་བསྒོམས་པ།
en: They have transcended the level of desire, the level of form, the level of formlessness, the level of the kleśas, the level of names, and the level of language. They are skilled in the way of letters and words.

source: བརྗོད་དུ་མེད་པའི་ཆོས་རྟོགས་པ།
en: They know freedom from letters. They have mastered the inexpressible Dharma.

source: ཡི་གེ་ཤེས་པ། ཡི་གེ་ལ་མཁས་པ།
en: They know letters. They are skilled in letters.

source: ཡི་གེ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ཤེས་པ་ལ་མཁས་པ།
en: They are skilled in the knowledge of the categories of letters and words.

source: ཡི་གེ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་རྒྱས་པ་ཤེས་པ་ལ་མཁས་པ།
en: They are skilled in the knowledge of the detailed categories of letters and words.

source: ཆོས་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བ་ཤེས་པ་ལ་མཁས་པ།
en: They are skilled in the knowledge of the categories of all the words of the Dharma.

source: ཆོས་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བ་རྒྱས་པ་ཤེས་པ་ལ་མཁས་པ།
en: They are skilled in the knowledge of the detailed categories of all the words of the Dharma.

source: ཆོས་ཐམས་ཅད་རྣམ་པར་དགོད་པ་ལ་མཁས་པ་ཡིན་ཏེ།
en: They are skilled in the knowledge of the presentation of all the Dharma.

source: གཏན་ལ་དབབ་པའི་བློ་དང་ལྡན་ཞིང་། བདུད་སྡིག་ཅན་དང་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་ཟིལ་གྱིས་མི་ནོན་ཏོ།
en: They are endowed with the certainty of understanding, so that all the evil māras and all the devas in their entourages cannot overcome them.”

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པའི་ཚེ་ལྷ་དང་མིའི་སྐྱེ་དགུ་སྔོན་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་རྩ་བརྒྱད་ཀྱིས་བྱེ་བ་བརྒྱ་སྟོང་འཁྱིལ་པའི་གཟུངས་དང་སྒྲིབ་པ་མེད་པའི་མཐའ་དང་ཆོས་རྣམ་པར་མཐོང་བའི་བཟོད་པ་སོ་སོར་ཐོབ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ཐམས་ཅད་ལ་བསྐལ་པ་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཞི་བཅུ་རྩ་བརྒྱད་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ་ཐམས་ཅད་ཀྱང་མིང་ནི་ཐ་དད།
en: At that time, when this Dharma teaching was given, ninety-eight times a hundred thousand million devas and human beings who had created the karma in previous lifetimes, had accumulated a trillion retentions, were unobscured, and had insight into the Dharma, all attained patience. The Bhagavān prophesied to them all that after four million, eight hundred thousand countless eons they would attain the highest, complete enlightenment of perfect buddhahood.

source: ཚེའི་ཚད་ནི་གཅིག་པར་སངས་རྒྱས་ཀྱི་ཞིང་སོ་སོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ་ཞེས་ལུང་བསྟན་ཏོ།
en: He prophesied to each of them their separate names, their identical lifespans, and the individual buddha realms where they would attain the highest, complete enlightenment of perfect buddhahood.

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་དང་ལྡན་པ་གང་།
en: “The wise bodhisattvas who seek to attain

source: །བླ་ན་མེད་པའི་བྱང་ཆུབ་རབ་ཚོལ་ཞིང་།
en: The highest, supreme enlightenment,

source: །ཆོས་དང་དེ་བཞིན་དོན་ལ་མཁས་པ་དེ།
en: Who are skilled in meaning and the Dharma,

source: །ཆོས་ཀྱི་ངོ་བོ་ཉིད་ལ་སྤྱོད་པ་ཡིན།
en: Practice the nature of phenomena. {1}

source: །ཡང་དག་མ་ཡིན་པ་ཡི་ཚིག་མི་སྨྲ།
en: “They say nothing that is untrue

source: །སངས་རྒྱས་ཡོན་ཏན་བྱེ་བྲག་ཅི་འདྲ་བ། །རྒྱལ་བ་རྣམས་ཀྱི་ཆོས་ནི་དེ་ཡིན་ཏེ།
en: About the unique qualities of the buddhas.

source: །དཔའ་བོ་ཐེ་ཙོམ་བྲལ་བས་ཤིན་ཏུ་རིག །ཆོས་ཀུན་དོན་གཅིག་པར་ནི་རབ་ཤེས་ཏེ།
en: The heroes, free of all doubt, Know the nature of the jinas. {2} “They know that all phenomena have but a single meaning,

source: །མགོ་གཅིག་ཏུ་ནི་སྟོང་པ་ཉིད་ཡིན་པས།
en: And that is solely emptiness.

source: །དེ་དག་ལ་ནི་ཐ་དད་གྱུར་པ་མེད།
en: They do not have different meanings.

source: །དོན་གཅིག་ལ་ནི་ཤིན་ཏུ་བསླབས་པ་ཡིན།
en: They become adept in that single meaning. {3}

source: །རྟོག་པ་མེད་ཅིང་རྣམ་རྟོག་མེད་པ་དང་། །དམིགས་པ་མེད་པར་བློ་གྲོས་ལྡན་པས་ཤེས།
en: “The wise know that they are without thought, Are devoid of thought, and that there is no object. They have eliminated without remainder

source: །ཟད་པ་དང་ནི་མི་ཟད་འདུ་ཤེས་ཀྱང་། །མ་ལུས་པར་ནི་ཐམས་ཅད་རབ་ཏུ་སྤངས།
en: Every conception of cessation and noncessation. {4}

source: །དེ་ནི་ཆོས་སྐུ་མི་ཡི་སེང་གེ་ལ། །སྟོབས་བཅུ་ལྡན་པ་གཟུགས་སུ་མི་ལྟ་ཞིང་།
en: “They do not see the one with ten strengths as form, But see the lion of men as the dharmakāya. Neither do they conceive of attributes

source: །དེ་ནི་ཕྱིན་ཅི་ལོག་ཀུན་རབ་སྤངས་པས།
en: Because they have eliminated all error. {5}

source: །མཚན་རྣམས་སུ་ཡང་ལྟ་བར་ཡོང་མི་འགྱུར། །ཆོས་རྣམས་འདི་དག་བསམ་མི་ཁྱབ།
en: “The qualities are inconceivable, beyond thought.

source: །བསམ་དང་བྲལ་ཞིང་རང་བཞིན་ཞི།
en: They have the nature of complete peace.

source: །དེ་ལྟ་བུར་ནི་རབ་ཤེས་ནས།
en: With this knowledge they thus see

source: །རྐང་གཉིས་གཙོ་བོ་སངས་རྒྱས་མཐོང་།
en: The buddhas as the supreme among humans. {6}

source: །ཇི་ལྟར་བདག་གི་འདུ་ཤེས་རིག །དེ་བཞིན་ཀུན་ཏུ་བློ་ཡང་གཏོང་།
en: “Just as they know their own conceptions to be, Thus they direct their understanding of everything.

source: །ཆོས་ཀུན་དེ་ཡི་རང་བཞིན་ཏེ།
en: All phenomena have that nature,

source: །རྣམ་པར་དག་པ་ནམ་མཁའ་བཞིན།
en: Which is as completely pure as space. {7}

source: །ཡིད་ལ་ནམས་ཀྱང་འབྱུང་བ་མེད།
en: “Nothing arises to their conceptual mind.

source: །ཆོས་རྣམས་ཐམས་ཅད་ཤེས་པས་ན།
en: They know emancipation from all phenomena.

source: །ཁམས་གསུམ་ལས་ནི་རྣམ་པར་གྲོལ།
en: They are liberated from the three realms

source: །དེ་ལ་སྨོན་ལམ་འདེབས་པ་མེད།
en: And they have no aspiration for them. {8}

source: །ཡང་དག་ཇི་བཞིན་དུ་ནི་མཐོང་གྱུར་ཅིང་།
en: “They are those who see correctly and do not say

source: །མ་ལོག་ཚིག་སྨྲ་རྣམ་པ་གཞན་མི་སྨྲ།
en: Anything to the contrary or any untrue words.

source: །དེ་ཡི་ཚིག་དང་བརྗོད་པ་ཐམས་ཅད་ཀྱང་།
en: All the words that they speak

source: །རྒྱལ་བ་དག་གི་མཐུ་ཡིས་འབྱུང་བར་འགྱུར།
en: Come forth through the power of the jinas. {9}

source: །འདོད་པའི་ས་དང་ཉོན་མོངས་ས་རྣམས་དང་། །གཟུགས་དང་གཟུགས་མེད་ལས་ཀྱང་ཤིན་ཏུ་འདའ།
en: “They transcend the level of desire, And the levels of kleśas, form, and formlessness.

source: །ཆོས་རྣམས་ལ་ནི་ཡིད་ཀྱང་མ་ཆགས་ཤིང་།
en: Their minds have no attachment to phenomena.

source: །རབ་ཏུ་དགའ་བས་འགྲོ་ལ་ཕན་པར་སྤྱོད།
en: They practice with joy, benefiting beings. {10}

source: །མིང་གི་ས་ལས་འདས་ཤིང་སྒྲ་ཡང་ཤེས།
en: “They have transcended the level of words;

source: །ངོ་བོ་ཉིད་ཀྱིས་གསོག་ཏུ་གྱུར་པ་སྟེ།
en: Their knowledge of language is obtained from its nature.

source: །ཇི་སྲིད་ཙམ་དུ་ཡུན་རིང་བརྗོད་ན་ཡང་།
en: For however long they speak

source: །དེ་ལ་གནས་པར་བྱེད་པ་ཡོད་མ་ཡིན།
en: They know those words have no basis. {11}

source: །འདུ་ཤེས་རབ་ཏུ་རྒྱུ་བ་མེད།
en: “There is no activity of conceptualization;

source: །ལྟ་བ་ལོག་པ་ཀུན་ནས་ཟད།
en: Incorrect views have completely ceased.

source: །བློ་ཡང་ཤིན་ཏུ་གཏན་ལ་ཕབ།
en: Their understanding is completely assured.

source: །བརྟན་པ་ནམ་མཁའ་འདྲ་བར་སྤྱོད།
en: It has a stability like that of space. {12}

source: །གལ་ཏེ་བདུད་བྱེ་ཁྲག་ཁྲིག་རྣམས།
en: “Even though quintillions of māras

source: །དེ་ཡི་སེམས་དཀྲུགས་ཕྱིར་འོངས་ཀྱང་།
en: Come to disturb their mind,

source: །བདུད་རྣམས་ཐམས་ཅད་ཟིལ་མནན་ཏེ།
en: They overcome all the māras

source: །དེ་ཡི་དབང་དུ་འགྲོ་མི་འགྱུར།
en: And do not fall under their power. {13}

source: །བདུད་ཀྱི་རྒྱ་མོ་རྣམས་སྤངས་ཏེ།
en: “They have rejected the net of the māras.

source: །ཚུལ་ཁྲིམས་ཡོངས་དག་གདུང་བ་མེད།
en: They have pure, untroubled conduct.

source: །བསམ་གཏན་དག་གི་བདེ་ལ་མོས།
en: They aspire to the bliss of dhyāna

source: །འཇིག་རྟེན་སྟོང་པར་རབ་ཏུ་ཤེས། །འཇིག་རྟེན་ཕུང་པོར་སྨྲས་པ་ཡང་།
en: And know the world to be empty. {14} “Even though it is said the world is an aggregate,

source: །དེ་དག་སྟོང་པར་རབ་ཏུ་རིག །སྐྱེ་བ་མེད་ཅིང་འགག་མེད་པས། །ཆོས་རྣམས་ཐམས་ཅད་ནམ་མཁའ་བཞིན།
en: They know it to be empty, And that all phenomena are like space, Without birth and without cessation. {15}

source: །དེ་དག་བདག་ཉིད་གཏོང་བྱེད་ཀྱི།
en: “They have forsaken the self, but not the conduct

source: །སྟོབས་བཅུའི་ཚུལ་ཁྲིམས་ཐོས་མི་གཏོང་།
en: Or listening to the teaching of the one with ten strengths.

source: །དེ་ནི་ཚུལ་ཁྲིམས་ཕ་རོལ་ཕྱིན།
en: They have attained perfect conduct

source: །གར་སྨོན་པར་ཡང་སྐྱེ་བར་འགྱུར།
en: And will be reborn wherever they pray to be. {16}

source: །སངས་རྒྱས་ཞིང་དུ་རྣམ་པར་འགྲོ།
en: “They go to the buddha realms.

source: །སངས་རྒྱས་ཁྲག་ཁྲིག་མང་པོ་མཐོང་།
en: They see many millions of buddhas.

source: །མཐོ་རིས་དག་ནི་མི་འདོད་དེ།
en: They have no desire for the deva realms

source: །སྨོན་ལམ་རྣམས་ནི་ཡོངས་མི་གཏོང་།
en: And they do not pray to be there. {17}

source: །ཆོས་ཉིད་དག་ནི་དེ་སྤྱོད་ཚེ།
en: “While they are practicing the Dharma,

source: །སྐད་ཅིག་བརྩོན་འགྲུས་ཉམས་མི་བྱེད།
en: Their diligence does not waver for an instant. They are highly praised by

source: །ཕྱོགས་བཅུ་ཡི་ནི་སངས་རྒྱས་ཀྱིས། །དེ་ནི་ཤིན་ཏུ་བསྟོད་པ་ཡིན།
en: The buddhas in the ten directions. {18}

source: །དེ་ཕྱིར་གཞོན་ནུ་ཏིང་འཛིན་ལས།
en: “Therefore, young man, when you have received

source: །ཆོས་འདི་དག་ནི་རབ་ཐོབ་ནས།
en: This Dharma teaching of the samādhi,

source: །ཤེས་ཀྱི་ཁེ་ནི་རྣམ་སྤོངས་ལ།
en: Rejecting the profits of the intellect,

source: །སྐྱེ་བོ་མང་ལ་ཆོས་རབ་སྟོན།
en: Teach this Dharma to the people. {19}

source: །སངས་རྒྱས་ཡོན་ཏན་མང་ལྡན་པ།
en: “One who wishes for the numerous qualities

source: །རང་འབྱུང་འགྱུར་བར་གང་འདོད་པས།
en: Possessed by the self-arisen buddha

source: །དགེ་བ་འདི་ལ་རབ་བསླབས་ན།
en: Should train in this goodness

source: །སྟོབས་བཅུ་འཆང་བ་སངས་རྒྱས་འགྱུར།
en: And become a buddha with the ten strengths.” {20}

source: །ཏིང་ངེ་འཛིན་ལ་རྗེས་སུ་སློབ་པའི་ལེའུ་སྟེ་བཅུ་གཉིས་པའོ།། །།
en: Conclusion of the twelfth chapter, “The Training According to the Samādhi.” The Teaching of the Samādhi Chapter 13

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། དེ་ལྟ་བས་ན་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཏིང་ངེ་འཛིན་ངེས་པར་བསྟན་པ་ལ་མཁས་པར་བྱའོ།
en: Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, bodhisattva mahāsattvas who wish for this samādhi, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, should be skilled in teaching this samādhi.

source: །གཞོན་ནུ་དེ་ལ་ཏིང་ངེ་འཛིན་ངེས་པར་བསྟན་པ་གང་ཞེ་ན།
en: “Young man, what is the teaching of this samādhi?

source: གང་ཆོས་ཐམས་ཅད་ཀྱི་ཇི་ལྟ་བ་བཞིན་ཉིད་དང་མཉམ་པ་ཉིད་མི་མཉམ་པ་མེད་པ་དང་མི་རྟོག་པ།
en: It is the true nature of all phenomena; it is equality; it is the absence of inequality; it is devoid of notions;

source: རྣམ་པར་མི་རྟོག་པ།
en: it is devoid of concepts;

source: རྣམ་པར་མ་བསྒྲུབས་པ།
en: it is devoid of creation;

source: ཀུན་ནས་སློང་བ་མེད་པ། སྐྱེ་བ་མེད་པ།
en: it is devoid of arising; it is devoid of production;

source: འགག་པ་མེད་པ།
en: it is devoid of cessation;

source: རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་དང་ཀུན་ནས་རྟོག་པ་ཡོངས་སུ་ཆད་པ།
en: it is the termination of notions, concepts, and assumptions;

source: སེམས་ཀྱི་དམིགས་པ་མེད་པ། ཡིད་ལ་བྱེད་པ་མེད་པ།
en: it is devoid of an object for the mind; it is devoid of a focus of the mind; it is the termination of designations;

source: རྣམ་པར་རིག་པ་ཡོངས་སུ་ཆད་པ།
en: it is the termination of concepts from analysis;

source: འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་ཡོངས་སུ་ཆད་པ།
en: it is the termination of desire, anger, and ignorance;

source: མཐའ་མེད་པ། མཐར་ཡིད་ལ་བྱེད་པ་དང་བྲལ་བ།
en: it is without a limited or limitless focus of the mind;

source: ཡིད་ལ་བྱེད་པ་ཡོངས་སུ་ཆད་པ།
en: it is the termination of any focus of the mind;

source: ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་ཀྱི་ངོ་བོ་ཉིད་ཤེས་པ།
en: it is the knowledge of the nature of the skandhas, dhātus, and āyatanas;

source: དྲན་པ་དང་བློ་གྲོས་དང་རྟོགས་པ་དང་ཁྲེལ་ཡོད་པ་དང་བརྟན་པ་དང་ཆོ་ག་དང་སྤྱོད་ཡུལ་དང་ནན་ཏན་གྱི་གནས་སུ་གྱུར་པ།
en: it is the state of accomplishing the field of activity that is the performance of the conduct of mindfulness, understanding, comprehension, conscience, and stability;

source: ཉོན་མོངས་པ་མེད་པའི་ས།
en: it is the level of freedom from corruptions; it is the level of peace;

source: ཞི་བའི་ས་སྤྲོས་པ་ཐམས་ཅད་ཡོངས་སུ་ཆད་པ།
en: it is the termination of all conceptual elaboration;

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་བསླབ་པ།
en: it is the training of all bodhisattvas;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ།
en: it is the field of activity of all tathāgatas;

source: །ཡོན་ཏན་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་འདི་ནི་གཞོན་ནུ་ཏིང་ངེ་འཛིན་ངེས་པར་བསྟན་པ་ཞེས་བྱ་སྟེ།
en: and it is the perfection of all good qualities. “Young man, that is what the teaching of samādhi is said to be.
